#include <iostream>
#include <string>
#include <windows.h>
#include "..\Modules\ModulesHoi.h"

using namespace std;

int main()
{
    SetConsoleCP(65001); SetConsoleOutputCP(65001);

    float input_9_1[13] = {0.2, 1.0, 2.5, 4.1, 6.3, 9.8, 12.0, 15.6, 20.2, 23.9, 26.0, 29.1, 50.3};

    float input_9_2[5][11] = {
        {7.2, 8.5, 7, 6.5, 8, 7.3, 8.5, 6.1, 5.6, 5.3},
        {-1, 0, 5, 1, 7.5, -5, 3.4, -7.5, -3.4, 0.},
        {-25, -26.7, -30.5, -28.5, -31.5, -34.5, - 37, -37.4, -35.9, -33},
        {7.9, 12, 9.1, 15, 8.6, 10.3, 11.1, 9, 9.1, 7.9},
        {5, 4.1, 3.5, 5.6, 8, 5.4, 6.9, 5.3, 6, 5.2},
    };

    int input_9_3[3] = {-3, 8192, 10};

    string output_9_1[13] = {
        "Бал Бофорта: 0. Відсутність вітру. Дим піднімається прямовисно. Листя дерев нерухомі.",
        "Бал Бофорта: 1. \"Дим пливе\". Флюгер не обертається.",
        "Бал Бофорта: 2. Рух повітря відчувається обличчям. Шелестить листя. Флюгер обертається.",
        "Бал Бофорта: 3. Тріпоче листя, хитаються дрібні гілки. Майорять прапори.",
        "Бал Бофорта: 4. Хитаються тонкі гілки дерев. Вітер піднімає пил та шматки паперу.",
        "Бал Бофорта: 5. Хитаються великі гілки. На воді з'являються хвилі.",
        "Бал Бофорта: 6. Хитаються великі гілки.",
        "Бал Бофорта: 7. Хитаються невеликі стовбури дерев.На морі здіймаються хвилі, піняться.",
        "Бал Бофорта: 8. Ламаються гілки дерев. Важко йти проти вітру.",
        "Бал Бофорта: 9. Невеликі руйнування. Зриває покрівлі, руйнує димарі.",
        "Бал Бофорта: 10. Значні руйнування. Дерева вириваються з корінням.",
        "Бал Бофорта: 11. Великі руйнування.",
        "Бал Бофорта: 12. Призводить до спустошень."
    };

    string output_9_2[5] = {
        "Середньомісячна температура у Цельсіях: 7.000000. Середньомісячна температура у Фаренгейтах: 44.599998",
        "Середньомісячна температура у Цельсіях: -0.000000. Середньомісячна температура у Фаренгейтах: 32.000000",
        "Середньомісячна температура у Цельсіях: -32.000000. Середньомісячна температура у Фаренгейтах: -25.600000",
        "Середньомісячна температура у Цельсіях: 10.000000. Середньомісячна температура у Фаренгейтах: 50.000000",
        "Середньомісячна температура у Цельсіях: 5.500000. Середньомісячна температура у Фаренгейтах: 41.900002"
    };

    string output_9_3[3] = {
        "Помилка. Некоректне значення.",
        "Кількість двійкових нулів: 13",
        "Кількість двійкових одиниць: 2",
    };

    int i;
    cout << boolalpha;

    cout << "Задача 9.1:\n";
    for (i = 0; i < size(output_9_1); i++)
        cout << i+1 << ". " << (Beaufort_score(input_9_1[i]) == output_9_1[i]) << endl;

    cout << "\nЗадача 9.2:\n";
    for (i = 0; i < size(output_9_2); i++)
        cout << i+1 << ". " << (average_temperature(input_9_2[i]) == output_9_2[i]) << endl;


    cout << "\nЗадача 9.3:\n";
    for (i = 0; i < size(output_9_3); i++)
        cout << i+1 << ". " << (amount_binary_digits(input_9_3[i]) == output_9_3[i]) << endl;

    return 0;
}
